tests/cassettes/test_create_stripe_purchase.yaml

interactions:
- request:
    body: amount=23000&currency=GBP&statement_descriptor_suffix=EMF+2025+purchase&metadata[user_id]=1&metadata[payment_id]=1
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      Content-Length:
      - '114'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 90582ef1-1afd-4010-97ed-ad91e3b01c5d
      Stripe-Version:
      - '2023-10-16'
      User-Agent:
      - Stripe/v1 PythonBindings/8.0.0
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "8.0.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.11.7", "platform": "Linux-5.15.49-linuxkit-aarch64-with-glibc2.31",
        "uname": "Linux 5cb7915c0fb8 5.15.49-linuxkit #1 SMP PREEMPT Tue Sep 13 07:51:32
        UTC 2022 aarch64 "}'
      authorization:
      - DUMMY
    method: POST
    uri: https://api.stripe.com/v1/payment_intents
  response:
    body:
      string: "{\n  \"id\": \"pi_3OiHFbHz0MWR65Xj0KidZr5i\",\n  \"object\": \"payment_intent\",\n
        \ \"amount\": 23000,\n  \"amount_capturable\": 0,\n  \"amount_details\": {\n
        \   \"tip\": {}\n  },\n  \"amount_received\": 0,\n  \"application\": null,\n
        \ \"application_fee_amount\": null,\n  \"automatic_payment_methods\": {\n
        \   \"allow_redirects\": \"always\",\n    \"enabled\": true\n  },\n  \"canceled_at\":
        null,\n  \"cancellation_reason\": null,\n  \"capture_method\": \"automatic\",\n
        \ \"client_secret\": \"pi_3OiHFbHz0MWR65Xj0KidZr5i_secret_Z9ikdFm8aaFuujx7VMlfTHP4M\",\n
        \ \"confirmation_method\": \"automatic\",\n  \"created\": 1707574191,\n  \"currency\":
        \"gbp\",\n  \"customer\": null,\n  \"description\": null,\n  \"invoice\":
        null,\n  \"last_payment_error\": null,\n  \"latest_charge\": null,\n  \"livemode\":
        false,\n  \"metadata\": {\n    \"payment_id\": \"1\",\n    \"user_id\": \"1\"\n
        \ },\n  \"next_action\": null,\n  \"on_behalf_of\": null,\n  \"payment_method\":
        null,\n  \"payment_method_configuration_details\": null,\n  \"payment_method_options\":
        {\n    \"card\": {\n      \"installments\": null,\n      \"mandate_options\":
        null,\n      \"network\": null,\n      \"request_three_d_secure\": \"automatic\"\n
        \   }\n  },\n  \"payment_method_types\": [\n    \"card\"\n  ],\n  \"processing\":
        null,\n  \"receipt_email\": null,\n  \"review\": null,\n  \"setup_future_usage\":
        null,\n  \"shipping\": null,\n  \"source\": null,\n  \"statement_descriptor\":
        null,\n  \"statement_descriptor_suffix\": \"EMF 2025 purchase\",\n  \"status\":
        \"requires_payment_method\",\n  \"transfer_data\": null,\n  \"transfer_group\":
        null\n}"
    headers:
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET,HEAD,PUT,PATCH,POST,DELETE
      Access-Control-Allow-Origin:
      - '*'
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Connection:
      - keep-alive
      Content-Length:
      - '1439'
      Content-Security-Policy:
      - report-uri https://q.stripe.com/csp-report?p=v1%2Fpayment_intents; block-all-mixed-content;
        default-src 'none'; base-uri 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'
      Content-Type:
      - application/json
      Date:
      - Sat, 10 Feb 2024 14:09:52 GMT
      Idempotency-Key:
      - 90582ef1-1afd-4010-97ed-ad91e3b01c5d
      Original-Request:
      - req_reP2uzOE3Oy0vT
      Request-Id:
      - req_reP2uzOE3Oy0vT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Stripe-Non-Api-Overhead-Duration-Ms:
      - '142.0'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      Stripe-Version:
      - '2023-10-16'
      User-Agent:
      - Stripe/v1 PythonBindings/8.0.0
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "8.0.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.11.7", "platform": "Linux-5.15.49-linuxkit-aarch64-with-glibc2.31",
        "uname": "Linux 5cb7915c0fb8 5.15.49-linuxkit #1 SMP PREEMPT Tue Sep 13 07:51:32
        UTC 2022 aarch64 "}'
      authorization:
      - DUMMY
    method: GET
    uri: https://api.stripe.com/v1/charges/ch_3OibCXHz0MWR65Xj09SoiLkW
  response:
    body:
      string: "{\n  \"id\": \"ch_3OibCXHz0MWR65Xj09SoiLkW\",\n  \"object\": \"charge\",\n
        \ \"amount\": 21000,\n  \"amount_captured\": 21000,\n  \"amount_refunded\":
        0,\n  \"application\": null,\n  \"application_fee\": null,\n  \"application_fee_amount\":
        null,\n  \"balance_transaction\": \"txn_3OibCXHz0MWR65Xj0FGYSo9U\",\n  \"billing_details\":
        {\n    \"address\": {\n      \"city\": null,\n      \"country\": null,\n      \"line1\":
        null,\n      \"line2\": null,\n      \"postal_code\": \"11111\",\n      \"state\":
        null\n    },\n    \"email\": \"test@example.com\",\n    \"name\": \"Initial Admin
        User\",\n    \"phone\": null\n  },\n  \"calculated_statement_descriptor\":
        \"STRIPE* EMF 2022 PURCH\",\n  \"captured\": true,\n  \"created\": 1707650896,\n
        \ \"currency\": \"gbp\",\n  \"customer\": null,\n  \"description\": null,\n
        \ \"destination\": null,\n  \"dispute\": null,\n  \"disputed\": false,\n  \"failure_balance_transaction\":
        null,\n  \"failure_code\": null,\n  \"failure_message\": null,\n  \"fraud_details\":
        {},\n  \"invoice\": null,\n  \"livemode\": false,\n  \"metadata\": {\n    \"payment_id\":
        \"1\",\n    \"user_id\": \"1\"\n  },\n  \"on_behalf_of\": null,\n  \"order\":
        null,\n  \"outcome\": {\n    \"network_status\": \"approved_by_network\",\n
        \   \"reason\": null,\n    \"risk_level\": \"normal\",\n    \"risk_score\":
        47,\n    \"seller_message\": \"Payment complete.\",\n    \"type\": \"authorized\"\n
        \ },\n  \"paid\": true,\n  \"payment_intent\": \"pi_3OibCXHz0MWR65Xj0sgHN7Ni\",\n
        \ \"payment_method\": \"pm_1OibCmHz0MWR65XjLoAoi9pj\",\n  \"payment_method_details\":
        {\n    \"card\": {\n      \"amount_authorized\": 21000,\n      \"brand\":
        \"visa\",\n      \"checks\": {\n        \"address_line1_check\": null,\n        \"address_postal_code_check\":
        \"pass\",\n        \"cvc_check\": \"pass\"\n      },\n      \"country\": \"US\",\n
        \     \"exp_month\": 1,\n      \"exp_year\": 2030,\n      \"extended_authorization\":
        {\n        \"status\": \"disabled\"\n      },\n      \"fingerprint\": \"qyoEjYqy9x1BibQI\",\n
        \     \"funding\": \"credit\",\n      \"incremental_authorization\": {\n        \"status\":
        \"unavailable\"\n      },\n      \"installments\": null,\n      \"last4\":
        \"4242\",\n      \"mandate\": null,\n      \"multicapture\": {\n        \"status\":
        \"unavailable\"\n      },\n      \"network\": \"visa\",\n      \"network_token\":
        {\n        \"used\": false\n      },\n      \"overcapture\": {\n        \"maximum_amount_capturable\":
        21000,\n        \"status\": \"unavailable\"\n      },\n      \"three_d_secure\":
        null,\n      \"wallet\": null\n    },\n    \"type\": \"card\"\n  },\n  \"radar_options\":
        {},\n  \"receipt_email\": null,\n  \"receipt_number\": null,\n  \"receipt_url\":
        \"https://pay.stripe.com/receipts/payment/CAcaFwoVYWNjdF8xT2RocXVIejBNV1I2NVhqKIjgoq4GMgYedyoyka46LBahzyoz_mteiHuUGNdxRBku7tg6ApTa33nAeRp-PNF-XsrlCpM5MQnZwei3\",\n
        \ \"refunded\": false,\n  \"review\": null,\n  \"shipping\": null,\n  \"source\":
        null,\n  \"source_transfer\": null,\n  \"statement_descriptor\": null,\n  \"statement_descriptor_suffix\":
        \"EMF 2022 purchase\",\n  \"status\": \"succeeded\",\n  \"transfer_data\":
        null,\n  \"transfer_group\": null\n}"
    headers:
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET,HEAD,PUT,PATCH,POST,DELETE
      Access-Control-Allow-Origin:
      - '*'
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Connection:
      - keep-alive
      Content-Length:
      - '2807'
      Content-Security-Policy:
      - report-uri https://q.stripe.com/csp-report?p=v1%2Fcharges%2F%3Acharge; block-all-mixed-content;
        default-src 'none'; base-uri 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'
      Content-Type:
      - application/json
      Date:
      - Sun, 11 Feb 2024 11:31:20 GMT
      Request-Id:
      - req_VdpSuQFycMuN0D
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Stripe-Non-Api-Overhead-Duration-Ms:
      - '79.99999999999999'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
    status:
      code: 200
      message: OK
- request:
    body: charge=ch_3OibCXHz0MWR65Xj09SoiLkW&amount=21000&metadata[refund_request]=1
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      Content-Length:
      - '74'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 37370c9d-b7ea-42d2-b8d0-b70e33e2e0d4
      Stripe-Version:
      - '2023-10-16'
      User-Agent:
      - Stripe/v1 PythonBindings/8.0.0
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_VdpSuQFycMuN0D", "request_duration_ms":
        0}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "8.0.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.11.7", "platform": "Linux-5.15.49-linuxkit-aarch64-with-glibc2.31",
        "uname": "Linux 5cb7915c0fb8 5.15.49-linuxkit #1 SMP PREEMPT Tue Sep 13 07:51:32
        UTC 2022 aarch64 "}'
      authorization:
      - DUMMY
    method: POST
    uri: https://api.stripe.com/v1/refunds
  response:
    body:
      string: "{\n  \"id\": \"re_3OibCXHz0MWR65Xj0KIi9Hq0\",\n  \"object\": \"refund\",\n
        \ \"amount\": 21000,\n  \"balance_transaction\": \"txn_3OibCXHz0MWR65Xj0q14l4Pn\",\n
        \ \"charge\": \"ch_3OibCXHz0MWR65Xj09SoiLkW\",\n  \"created\": 1707651081,\n
        \ \"currency\": \"gbp\",\n  \"destination_details\": {\n    \"card\": {\n
        \     \"reference_status\": \"pending\",\n      \"reference_type\": \"acquirer_reference_number\",\n
        \     \"type\": \"refund\"\n    },\n    \"type\": \"card\"\n  },\n  \"metadata\":
        {\n    \"refund_request\": \"1\"\n  },\n  \"payment_intent\": \"pi_3OibCXHz0MWR65Xj0sgHN7Ni\",\n
        \ \"reason\": null,\n  \"receipt_number\": null,\n  \"source_transfer_reversal\":
        null,\n  \"status\": \"succeeded\",\n  \"transfer_reversal\": null\n}"
    headers:
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET,HEAD,PUT,PATCH,POST,DELETE
      Access-Control-Allow-Origin:
      - '*'
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Connection:
      - keep-alive
      Content-Length:
      - '645'
      Content-Security-Policy:
      - report-uri https://q.stripe.com/csp-report?p=v1%2Frefunds; block-all-mixed-content;
        default-src 'none'; base-uri 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'
      Content-Type:
      - application/json
      Date:
      - Sun, 11 Feb 2024 11:31:21 GMT
      Idempotency-Key:
      - 37370c9d-b7ea-42d2-b8d0-b70e33e2e0d4
      Original-Request:
      - req_fQu9FhEOR2ZON5
      Request-Id:
      - req_fQu9FhEOR2ZON5
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Stripe-Non-Api-Overhead-Duration-Ms:
      - '764.0'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
    status:
      code: 200
      message: OK
- request:
    body: null
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate, br
      Connection:
      - keep-alive
      Stripe-Version:
      - '2023-10-16'
      User-Agent:
      - Stripe/v1 PythonBindings/8.0.0
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "8.0.0", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.11.7", "platform": "Linux-5.15.49-linuxkit-aarch64-with-glibc2.31",
        "uname": "Linux 5cb7915c0fb8 5.15.49-linuxkit #1 SMP PREEMPT Tue Sep 13 07:51:32
        UTC 2022 aarch64 "}'
      authorization:
      - DUMMY
    method: GET
    uri: https://api.stripe.com/v1/charges/ch_3OibCXHz0MWR65Xj09SoiLkW
  response:
    body:
      string: "{\n  \"id\": \"ch_3OibCXHz0MWR65Xj09SoiLkW\",\n  \"object\": \"charge\",\n
        \ \"amount\": 21000,\n  \"amount_captured\": 21000,\n  \"amount_refunded\":
        21000,\n  \"application\": null,\n  \"application_fee\": null,\n  \"application_fee_amount\":
        null,\n  \"balance_transaction\": \"txn_3OibCXHz0MWR65Xj0FGYSo9U\",\n  \"billing_details\":
        {\n    \"address\": {\n      \"city\": null,\n      \"country\": null,\n      \"line1\":
        null,\n      \"line2\": null,\n      \"postal_code\": \"11111\",\n      \"state\":
        null\n    },\n    \"email\": \"test@example.com\",\n    \"name\": \"Initial Admin
        User\",\n    \"phone\": null\n  },\n  \"calculated_statement_descriptor\":
        \"STRIPE* EMF 2022 PURCH\",\n  \"captured\": true,\n  \"created\": 1707650896,\n
        \ \"currency\": \"gbp\",\n  \"customer\": null,\n  \"description\": null,\n
        \ \"destination\": null,\n  \"dispute\": null,\n  \"disputed\": false,\n  \"failure_balance_transaction\":
        null,\n  \"failure_code\": null,\n  \"failure_message\": null,\n  \"fraud_details\":
        {},\n  \"invoice\": null,\n  \"livemode\": false,\n  \"metadata\": {\n    \"payment_id\":
        \"1\",\n    \"user_id\": \"1\"\n  },\n  \"on_behalf_of\": null,\n  \"order\":
        null,\n  \"outcome\": {\n    \"network_status\": \"approved_by_network\",\n
        \   \"reason\": null,\n    \"risk_level\": \"normal\",\n    \"risk_score\":
        47,\n    \"seller_message\": \"Payment complete.\",\n    \"type\": \"authorized\"\n
        \ },\n  \"paid\": true,\n  \"payment_intent\": \"pi_3OibCXHz0MWR65Xj0sgHN7Ni\",\n
        \ \"payment_method\": \"pm_1OibCmHz0MWR65XjLoAoi9pj\",\n  \"payment_method_details\":
        {\n    \"card\": {\n      \"amount_authorized\": 21000,\n      \"brand\":
        \"visa\",\n      \"checks\": {\n        \"address_line1_check\": null,\n        \"address_postal_code_check\":
        \"pass\",\n        \"cvc_check\": \"pass\"\n      },\n      \"country\": \"US\",\n
        \     \"exp_month\": 1,\n      \"exp_year\": 2030,\n      \"extended_authorization\":
        {\n        \"status\": \"disabled\"\n      },\n      \"fingerprint\": \"qyoEjYqy9x1BibQI\",\n
        \     \"funding\": \"credit\",\n      \"incremental_authorization\": {\n        \"status\":
        \"unavailable\"\n      },\n      \"installments\": null,\n      \"last4\":
        \"4242\",\n      \"mandate\": null,\n      \"multicapture\": {\n        \"status\":
        \"unavailable\"\n      },\n      \"network\": \"visa\",\n      \"network_token\":
        {\n        \"used\": false\n      },\n      \"overcapture\": {\n        \"maximum_amount_capturable\":
        21000,\n        \"status\": \"unavailable\"\n      },\n      \"three_d_secure\":
        null,\n      \"wallet\": null\n    },\n    \"type\": \"card\"\n  },\n  \"radar_options\":
        {},\n  \"receipt_email\": null,\n  \"receipt_number\": null,\n  \"receipt_url\":
        \"https://pay.stripe.com/receipts/payment/CAcaFwoVYWNjdF8xT2RocXVIejBNV1I2NVhqKLbgoq4GMgawEAmvi6s6LBbS3hgKtCJtw4QOESWGae5cq9wU8F8Yv5Zf9dij-gcQ_bDQ_jpJAkZG_QbK\",\n
        \ \"refunded\": true,\n  \"review\": null,\n  \"shipping\": null,\n  \"source\":
        null,\n  \"source_transfer\": null,\n  \"statement_descriptor\": null,\n  \"statement_descriptor_suffix\":
        \"EMF 2022 purchase\",\n  \"status\": \"succeeded\",\n  \"transfer_data\":
        null,\n  \"transfer_group\": null\n}"
    headers:
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET,HEAD,PUT,PATCH,POST,DELETE
      Access-Control-Allow-Origin:
      - '*'
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Connection:
      - keep-alive
      Content-Length:
      - '2810'
      Content-Security-Policy:
      - report-uri https://q.stripe.com/csp-report?p=v1%2Fcharges%2F%3Acharge; block-all-mixed-content;
        default-src 'none'; base-uri 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'
      Content-Type:
      - application/json
      Date:
      - Sun, 11 Feb 2024 11:32:06 GMT
      Request-Id:
      - req_JtAfXPsoab9wa9
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
      Stripe-Version:
      - '2023-10-16'
      Vary:
      - Origin
      X-Stripe-Non-Api-Overhead-Duration-Ms:
      - '75.00000000000001'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
    status:
      code: 200
      message: OK
version: 1
