tests/webhook_fixtures/payment_intent.succeeded.json

{
  "id": "pi_1GUslpIcI91cWsdeheAuRsyg",
  "object": "payment_intent",
  "allowed_source_types": ["card"],
  "amount": 23000,
  "amount_capturable": 0,
  "amount_received": 23000,
  "application": null,
  "application_fee_amount": null,
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "automatic",
  "charges": {
    "object": "list",
    "data": [
      {
        "id": "ch_1GUslxIcI91cWsde5jePBfRQ",
        "object": "charge",
        "amount": 23000,
        "amount_refunded": 0,
        "application": null,
        "application_fee": null,
        "application_fee_amount": null,
        "balance_transaction": "txn_1GUslxIcI91cWsdenOKhyR4i",
        "billing_details": {
          "address": {
            "city": null,
            "country": null,
            "line1": null,
            "line2": null,
            "postal_code": "42424",
            "state": null
          },
          "email": "russ@garrett.co.uk",
          "name": "Russ",
          "phone": null
        },
        "calculated_statement_descriptor": "RUSS.GARRE* EMF 2020 P",
        "captured": true,
        "created": 1586171145,
        "currency": "gbp",
        "customer": null,
        "description": null,
        "destination": null,
        "dispute": null,
        "disputed": false,
        "failure_code": null,
        "failure_message": null,
        "fraud_details": {},
        "invoice": null,
        "livemode": false,
        "metadata": {
          "user_id": "1",
          "payment_id": "2"
        },
        "on_behalf_of": null,
        "order": null,
        "outcome": {
          "network_status": "approved_by_network",
          "reason": null,
          "risk_level": "normal",
          "risk_score": 55,
          "seller_message": "Payment complete.",
          "type": "authorized"
        },
        "paid": true,
        "payment_intent": "pi_1GUslpIcI91cWsdeheAuRsyg",
        "payment_method": "pm_1GUslxIcI91cWsdeBYozsFYU",
        "payment_method_details": {
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": "pass",
              "cvc_check": "pass"
            },
            "country": "US",
            "exp_month": 4,
            "exp_year": 2024,
            "fingerprint": "VKnD4kq2Jm2zibNl",
            "funding": "credit",
            "installments": null,
            "last4": "4242",
            "network": "visa",
            "three_d_secure": null,
            "wallet": null
          },
          "type": "card"
        },
        "receipt_email": null,
        "receipt_number": null,
        "receipt_url": "https://pay.stripe.com/receipts/acct_14i5G7IcI91cWsde/ch_1GUslxIcI91cWsde5jePBfRQ/rcpt_H2yjkWzJc46LbnTbSqH7RdXWbbaVDSU",
        "refunded": false,
        "refunds": {
          "object": "list",
          "data": [],
          "has_more": false,
          "total_count": 0,
          "url": "/v1/charges/ch_1GUslxIcI91cWsde5jePBfRQ/refunds"
        },
        "review": null,
        "shipping": null,
        "source": null,
        "source_transfer": null,
        "statement_descriptor": null,
        "statement_descriptor_suffix": "EMF 2020 purchase",
        "status": "succeeded",
        "transfer_data": null,
        "transfer_group": null
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/charges?payment_intent=pi_1GUslpIcI91cWsdeheAuRsyg"
  },
  "client_secret": "pi_1GUslpIcI91cWsdeheAuRsyg_secret_jm7QnCtrTMjZKeYmqmmmlXZlj",
  "confirmation_method": "automatic",
  "created": 1586171137,
  "currency": "gbp",
  "customer": null,
  "description": null,
  "invoice": null,
  "last_payment_error": null,
  "livemode": false,
  "metadata": {
    "user_id": "1",
    "payment_id": "2"
  },
  "next_action": null,
  "next_source_action": null,
  "on_behalf_of": null,
  "payment_method": "pm_1GUslxIcI91cWsdeBYozsFYU",
  "payment_method_options": {
    "card": {
      "installments": null,
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": ["card"],
  "receipt_email": null,
  "review": null,
  "setup_future_usage": null,
  "shipping": null,
  "source": null,
  "statement_descriptor": null,
  "statement_descriptor_suffix": "EMF 2020 purchase",
  "status": "succeeded",
  "transfer_data": null,
  "transfer_group": null
}
